RealWorld/app/controllers/articles_controller.rb

  def index
    articles = Article.all
---
SELECT `articles`.* FROM `articles`

  def create
    article = Article.new(article_params)
    if article.save
---
INSERT INTO `articles` (`slug`, `title`, `description`, `body`, `created_at`, `updated_at`) VALUES ('how-to-train-your-dragon', 'How to train your dragon', 'Ever wonder how?', 'Very carefully.', '2023-06-18 07:19:32.488460', '2023-06-18 07:19:32.488460')

  def update
    @article.update(article_params)
---
UPDATE `articles` SET `articles`.`body` = 'With two hands', `articles`.`updated_at` = '2023-06-18 13:25:15.363443' WHERE `articles`.`id` = 9

  def set_article
    @article = Article.find_by_slug(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`slug` = 'how_to_train_your_dragon1' LIMIT 1